Revit 2027 API
ACADExportOptions Class
 The base class for options used to export DWG and DXF format files.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BaseExportOptions
 Autodesk.Revit.DB.ACADExportOptions
 Autodesk.Revit.DB.DWGExportOptions
 Autodesk.Revit.DB.DXFExportOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ACADExportOptions : BaseExportOptions
Public Class ACADExportOptions
	Inherits BaseExportOptions
public ref class ACADExportOptions : public BaseExportOptions
type ACADExportOptions =
    class
        inherit BaseExportOptions
    end
The ACADExportOptions type exposes the following members.
Properties
Name | Description
ACAPreference |  The preferred way to generate geometry of ACA objects. Default value is ACAObjectPreference.Object.
Colors |  Export color mode. Default value is ExportColorMode.IndexColors.
(Inherited from BaseExportOptions)
ExportingAreas |  True to export area and room geometry, false otherwise. Default value is false.
ExportOfSolids |  The mode used to export solids in 3D views. Default value is SolidGeometry.Polymesh.
FileVersion |  ACADVersion::Default Default value is ACADVersion.Default.
HatchBackgroundColor |  The color that will be set as hatch backgound color on the exported hatch. This color will be used only if useHatchBackgroundColor is true. default value is white
HatchPatternsFileName |  Custom hatch patterns (pat) file name.
(Inherited from BaseExportOptions)
HideReferencePlane |  Whether or not to hide reference planes. Default value is false.
(Inherited from BaseExportOptions)
HideScopeBox |  Whether or not to hide the scope box. Default value is false.
(Inherited from BaseExportOptions)
HideUnreferenceViewTags |  Whether or not to hide unreference view tags. Default value is false.
(Inherited from BaseExportOptions)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from BaseExportOptions)
LayerMapping |  Name of a layer settings standard or filename (with custom layer settings). Valid standards are: DGNV7 (only for DGN), AIA, CP83, BS1192, and ISO13567. default value is "" (empty) which means if no value is set, if no value is set, Revit will use a default value according to the localization.
(Inherited from BaseExportOptions)
LineScaling |  The scaling mode for the line type. Default value is LineScaling.ViewScale.
LinetypesFileName |  The custom linetype file name (*.lin). Default value is empty.
MarkNonplotLayers |  If true and the nonplot layer suffix is not empty, all layers whose names contain that suffix will be marked as non-plot.
NonplotSuffix |  If the MarkNonplotLayers attribute is set to true, all layers with names containing this suffix will be marked as non-plot. No action will be performed if the suffix is empty.
PreserveCoincidentLines |  Whether or not to preserve coincident lines. Default value is false.
(Inherited from BaseExportOptions)
PropOverrides |  How to export overridden object styles. Default value is PropOverrideMode.ByEntity.
(Inherited from BaseExportOptions)
SharedCoords |  True to use the shared coordinate system's origin, false to use the project origin. Default value is false.
TargetUnit |  The target unit type. Default value is ExportUnit.Default.
TextTreatment |  The text treatment. Deault value is TextTreatment.Exact.
UseHatchBackgroundColor |  Indicates if hatch background color will be used or not. default value is false.
Top
Methods
Name | Description
Dispose
(Inherited from BaseExportOptions)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetExportFontTable |  Gets font table.
(Inherited from BaseExportOptions)
GetExportLayerTable |  Gets the layer table.
(Inherited from BaseExportOptions)
GetExportLinetypeTable |  Gets a copy of the line type table.
(Inherited from BaseExportOptions)
GetExportPatternTable |  Gets a copy of the pattern table.
(Inherited from BaseExportOptions)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetExportFontTable |  Sets font table to option.
(Inherited from BaseExportOptions)
SetExportLayerTable |  Sets layer table back to option
(Inherited from BaseExportOptions)
SetExportLinetypeTable |  Sets the line type table to use during export.
(Inherited from BaseExportOptions)
SetExportPatternTable |  Sets the pattern table to use during export.
(Inherited from BaseExportOptions)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace